goals_app/app/views/layouts/application.html.erb

  <% if @user %>
  <% if User.find_by(id: @user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]