goals_app/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-09-14 23:23:24.691339"], ["session_token", "6HVc0ZJ4ai8NmeG_t7HVhA"], ["id", 6]]
---
  def resets_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!